function z=point_in_T(f,x,y)
% f为给定三角形的三个顶点，格式为[x1 y1 z1 x2 y2 z2 x3 y3 z3]
% 实现方法
 % syms t
 % A=[x y t 1;f(1) f(2) f(3) 1;f(4) f(5) f(6) 1;f(7) f(8) f(9) 1];
 % z=double(solve(det(A)));
z=-(f(1)*f(6)*f(8) - f(1)*f(5)*f(9) + f(2)*f(4)*f(9) - f(2)*f(6)*f(7) - f(3)*f(4)*f(8) + f(3)*f(5)*f(7) + ...
     f(2)*f(6)*x - f(3)*f(5)*x - f(2)*f(9)*x + f(3)*f(8)*x + f(5)*f(9)*x - f(6)*f(8)*x - ...
     f(1)*f(6)*y + f(3)*f(4)*y + f(1)*f(9)*y - f(3)*f(7)*y - f(4)*f(9)*y + f(6)*f(7)*y)/ ...
    (f(1)*f(5) - f(2)*f(4) - f(1)*f(8) + f(2)*f(7) + f(4)*f(8) - f(5)*f(7));
end